IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 i PIC 9(3).

PROCEDURE DIVISION.
    PERFORM VARYING i FROM 1 BY 1 UNTIL i > 100
        IF FUNCTION MOD(i, 15) = 0 THEN
            DISPLAY 'FizzBuzz'
        ELSE IF FUNCTION MOD(i, 3) = 0 THEN
            DISPLAY 'Fizz'
        ELSE IF FUNCTION MOD(i, 5) = 0 THEN
            DISPLAY 'Buzz'
        ELSE
            DISPLAY i
    END-PERFORM.
    STOP RUN.
